app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "usersname") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(permittedparams)
    if @user.save then

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 9  [["password_digest", "$2a$10$OJ8z8SNcFlJgGSINEfxobuTY/HVKFZ2B/TIqXcb28pBSw6ZxzaHv."], ["updated_at", Wed, 16 Oct 2013 13:42:34 UTC +00:00]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(permittedparams)